app/controllers/posts_controller.rb

INSERT INTO "posts" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "hello world"], ["user_id", 1], ["created_at", "2015-11-24 23:13:55.033610"], ["updated_at", "2015-11-24 23:13:55.033610"]]
SELECT "users".* FROM "users"
---
  def create
    @post = Post.new(post_params)

    if @post.save
      redirect_to posts_path
    else
      @users = User.all

UPDATE "posts" SET "message" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["message", "New message"], ["updated_at", "2015-11-24 23:42:16.067827"], ["id", 2]]
---
  def update
    if @post.update(post_params)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
---
  def find_post
    begin
      @post = Post.find(params[:id])