app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "marc@lol.com"], ["name", "marc"], ["created_at", "2015-11-24 23:02:18.571136"], ["updated_at", "2015-11-24 23:02:18.571136"]]